import scipy

""" 
Kendall Tau Correlation เป็นการหาความสัมพันธ์ระหว่างตัวแปร 2 ตัวที่อยู่ในมาตราการวัดระดับ Ordinal Scale โดยปกติจะมีค่าอยู่ระหว่าง -1.00 ถึง 1.00
- ถ้ามีค่าติดลบหมายความว่า ตัวแปร 2 ตัวมีความสัมพันธ์ในทิศทางตรงกันข้าม
- ถ้ามีค่าเป็นบวกหมายความว่า ตัวแปร 2 ตัวมีความสัมพันธ์ในทิศทางเดียวกัน
- ถ้ามีค่าเป็น 0 หมายความว่าตัวแปร 2 ตัวไม่มีความสัมพันธ์กัน
"""

"""
Web Framwork:
1. React.js x
2. Angular /
3. Vue.js /
4. JQuery / 
5. Next
6. Svelte
7. Ember /
8. Flutter
9. Nuxt
10. Flask
"""

x1 = [1, 2, 3, 4, 5, 6]
x2 = [1, 4, 3, 2, 5, 6]
tau, p_value = scipy.stats.kendalltau(x1, x2)
print(tau)